<?php
/******************************************************************************
 * 描述：创建管理员表
 * 文件：userCreateTable.php
 * ============================================================================
 * 版权所有 2007-2019 武汉道广科技有限公司，并保留所有权利。
 * 网站地址: http://www.dgosc.com；
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * 作者: Nginx
 * 日期：2020年12月01日
 * 时间：09:29
 ******************************************************************************/

namespace  dgosc\user\rbac;

use think\Db;
use think\facade\Env;

class UserCreateTable
{
    private $_lockFile = '';
    private $_sqlFile = '';

    public function __construct()
    {
        $this->_lockFile = Env::get('root_path') . 'runtime/user_rbac_sql.lock';
        $this->_sqlFile = dirname(__DIR__) . '/dgosc_user_rbac.sql';
    }

    /**
     ***************************************************************************************
     * 描述: 创建数据表
     * 函数: create
     * =====================================================================================
     * 作者: 武汉道广科技有限公司
     * 邮箱: dgosc@163.com
     * 日期：2020年12月01日 09:31
     * =====================================================================================
     * * @param string $db
     ***************************************************************************************
     */
    public function create($db = '')
    {
        $dbConfig = Db::getConfig();
        $prefix = $db == ''? $dbConfig['prefix'] : $dbConfig[$db]['prefix'];

        if (file_exists($this->_lockFile)) {
            echo "<b style='color:red'>数据库创建操作被锁定，请删除[{$this->_lockFile}]文件后重试</b>";
            exit;
        }

        if ($this->_generateSql($prefix) === false) {
            echo '执行sql语句出错，请检查配置';
            exit;
        }
        echo '执行成功,如非必要请不要解锁后再次执行，重复执行会清空原有rbac表中的数据';
        $this->_writeLock();
        exit;
    }

    /**
     ***************************************************************************************
     * 描述: 执行sql语句
     * 函数: _generateSql
     * =====================================================================================
     * 作者: 武汉道广科技有限公司
     * 邮箱: dgosc@163.com
     * 日期：2020年12月01日 09:32
     * =====================================================================================
     * @param string $prefix
     * @return bool
     ***************************************************************************************
     */
    private function _generateSql($prefix = '')
    {
        $sql = $this->_loadSqlFile();
        $prefix = empty($prefix)? '' : $prefix;
        $sql = str_replace('###', $prefix, $sql);
        $sqlArr = explode(';', $sql);
        if (Db::batchQuery($sqlArr) === false) {
            return false;
        }
        return true;
    }

    /**
     ***************************************************************************************
     * 描述: 加载SQL文件
     * 函数: _loadSqlFile
     * =====================================================================================
     * 作者: 武汉道广科技有限公司
     * 邮箱: dgosc@163.com
     * 日期：2020年12月01日 09:32
     * =====================================================================================
     * @return false|string
     ***************************************************************************************
     */
    private function _loadSqlFile()
    {
        $fileObj = fopen($this->_sqlFile, 'r');
        $sql = fread($fileObj, filesize($this->_sqlFile));
        fclose($fileObj);
        return $sql;
    }

    /**
     ***************************************************************************************
     * 描述: 创建数据库操作锁
     * 函数: _writeLock
     * =====================================================================================
     * 作者: 武汉道广科技有限公司
     * 邮箱: dgosc@163.com
     * 日期：2020年12月01日 09:33
     * =====================================================================================
     *
     ***************************************************************************************
     */
    private function _writeLock()
    {
        $fileObj = fopen($this->_lockFile, 'w');
        fwrite($fileObj, date("Y-m-d H:i:s") . '执行成功!');
        fclose($fileObj);
    }

}